<a href="https://colab.research.google.com/github/JumpNShootMan/TP_MachineLearning/blob/Develop/TP_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Trabajo Parcial de Machine Learning

In [ ]:
from google.colab import drive
drive.mount("/content/drive/")

In [ ]:
!pip install opencv-python==3.4.2.16
!pip install opencv-contrib-python==3.4.2.16
import cv2
import numpy as np
import pandas as pd
import os
from sklearn.cluster import KMeans
from matplotlib import pyplot as plt

Collecting opencv-python==3.4.2.16
  Downloading https://files.pythonhosted.org/packages/fa/7d/5042b668a8ed41d2a80b8c172f5efcd572e3c046c75ae029407e19b7fc68/opencv_python-3.4.2.16-cp36-cp36m-manylinux1_x86_64.whl (25.0MB)
     |████████████████████████████████| 25.0MB 172kB/s
Requirement already satisfied: numpy>=1.11.3 in /usr/local/lib/python3.6/dist-packages (from opencv-python==3.4.2.16) (1.18.5)
ERROR: albumentations 0.1.12 has requirement imgaug<0.2.7,>=0.2.5, but you'll have imgaug 0.2.9 which is incompatible.
Installing collected packages: opencv-python
  Found existing installation: opencv-python 4.1.2.30
    Uninstalling opencv-python-4.1.2.30:
      Successfully uninstalled opencv-python-4.1.2.30
Successfully installed opencv-python-3.4.2.16
Collecting opencv-contrib-python==3.4.2.16
  Downloading https://files.pythonhosted.org/packages/08/f1/66330f4042c4fb3b2d77a159db8e8916d9cdecc29bc8c1f56bc7f8a9bec9/opencv_contrib_python-3.4.2.16-cp36-cp36m-manylinux1_x86_64.whl (30.6MB)
     |████████████████████████████████| 30.6MB 99kB/s
Requirement already satisfied: numpy>=1.11.3 in /usr/local/lib/python3.6/dist-packages (from opencv-contrib-python==3.4.2.16) (1.18.5)
Installing collected packages: opencv-contrib-python
  Found existing installation: opencv-contrib-python 4.1.2.30
    Uninstalling opencv-contrib-python-4.1.2.30:
      Successfully uninstalled opencv-contrib-python-4.1.2.30
Successfully installed opencv-contrib-python-3.4.2.16

In [245]:
data = pd.read_csv('https://raw.githubusercontent.com/JumpNShootMan/TP_MachineLearning/master/datos_banco.csv', encoding='latin-1')

data.head(15)

           idPrestamo  target  ... default_request_term  default_request_amount
0   LIBDISP9832897855       1  ...                    1                       0
1   LIBDISP9021501745       1  ...                    0                       0
2   LIBDISP4057314971       0  ...                    0                       0
3   LIBDISP8375185888       0  ...                    0                       0
4   LIBDISP9694463037       0  ...                    1                       0
5   LIBDISP0492929616       0  ...                    1                       0
6   LIBDISP6813272232       0  ...                    0                       0
7   LIBDISP8862427268       1  ...                    1                       0
8   LIBDISP7167831610       0  ...                    1                       0
9   LIBDISP3835927929       1  ...                    1                       0
10  LIBDISP0355045033       0  ...                    0                       0
11  LIBDISP5414743218       0  ...                    0                       0
12  LIBDISP1965000460       0  ...                    0                       0
13  LIBDISP1947886051       0  ...                    1                       0
14  LIBDISP4328432214       1  ...                    1                       0

[15 rows x 14 columns]

In [246]:
data.dtypes

idPrestamo                        object
target                             int64
monthly_debt_capacity             object
var_employment_time_in_months    float64
approved_amount                   object
approved_term                      int64
approved_interest_amount          object
var_net_income                   float64
person_gender                     object
credit_history_marital_status     object
var_max_sbs_qual_12m              object
person_degree_type_desc           object
default_request_term               int64
default_request_amount             int64
dtype: object

# Tratamiento de datos

In [247]:
del data["idPrestamo"]
del data["default_request_amount"]

In [255]:
data.groupby('var_max_sbs_qual_12m').size()
data.groupby('person_degree_type_desc').size()

person_degree_type_desc
0    624
1     65
2      3
3    220
4    807
dtype: int64

In [252]:
for i in range(len(data['person_degree_type_desc'])):
  if data['person_degree_type_desc'][i] == "Carrera TÃÂ©cnica" or data['person_degree_type_desc'][i] == "Carrera TÌÄå©cnica":
    data['person_degree_type_desc'][i] = "Carrera Tecnica"

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [254]:
data.var_max_sbs_qual_12m = pd.Categorical(data.var_max_sbs_qual_12m)
data.var_max_sbs_qual_12m = data.var_max_sbs_qual_12m.cat.codes
data.person_degree_type_desc = pd.Categorical(data.person_degree_type_desc)
data.person_degree_type_desc = data.person_degree_type_desc.cat.codes
data.head()

   target monthly_debt_capacity  ...  person_degree_type_desc default_request_term
0       1                252.39  ...                        3                    1
1       1                244.57  ...                        3                    0
2       0                 491.5  ...                        3                    0
3       0                848.65  ...                        4                    0
4       0                470.52  ...                        4                    1

[5 rows x 12 columns]

In [256]:
genero = {'MALE': 0, 'FEMALE': 1, 0: 0, 1: 1}
estado = {'C': 0 , 'S': 1, 'D': 2, 'V': 3, 0:0,1:1,2:2,3:3}
data.person_gender = [genero[item] for item in data.person_gender]
data.credit_history_marital_status = [estado[item] for item in data.credit_history_marital_status]
data.credit_history_marital_status = [estado[item] for item in data.credit_history_marital_status]
data.head()

   target monthly_debt_capacity  ...  person_degree_type_desc default_request_term
0       1                252.39  ...                        3                    1
1       1                244.57  ...                        3                    0
2       0                 491.5  ...                        3                    0
3       0                848.65  ...                        4                    0
4       0                470.52  ...                        4                    1

[5 rows x 12 columns]

In [257]:
data.describe()

            target  ...  default_request_term
count  1719.000000  ...           1719.000000
mean      0.295521  ...              0.507853
std       0.456409  ...              0.500084
min       0.000000  ...              0.000000
25%       0.000000  ...              0.000000
50%       0.000000  ...              1.000000
75%       1.000000  ...              1.000000
max       1.000000  ...              1.000000

[8 rows x 9 columns]

In [258]:
indices = []
print("\t\t Features \t miss values \t values")
for i in data:
  count = 0
  for j in range(len(data[i])):
    if data[i].dtype == "float64":
      if np.isnan(data[i][j]):
        count +=1
        indices.append(j)
        data[i][j] = 33.979592
  print("%30s \t %10d  %10d"%(i, count,len(data[i])) )

print(indices)

		 Features 	 miss values 	 values
                        target 	          0        1719
         monthly_debt_capacity 	          0        1719
 var_employment_time_in_months 	        200        1719
               approved_amount 	          0        1719
                 approved_term 	          0        1719
      approved_interest_amount 	          0        1719
                var_net_income 	          0        1719
                 person_gender 	          0        1719
 credit_history_marital_status 	          0        1719
          var_max_sbs_qual_12m 	          0        1719
       person_degree_type_desc 	          0        1719
          default_request_term 	          0        1719
[8, 40, 70, 74, 76, 103, 109, 114, 133, 141, 147, 164, 169, 171, 198, 207, 212, 219, 233, 262, 265, 268, 269, 270, 275, 289, 293, 309, 317, 322, 334, 339, 340, 355, 361, 364, 372, 394, 398, 399, 402, 415, 439, 444, 471, 475, 484, 488, 493, 494, 497, 499, 516, 520, 525, 539, 559, 568, 570, 573, 579, 584, 592, 603, 609, 610, 618, 632, 649, 660, 681, 686, 694, 701, 703, 704, 706, 708, 715, 723, 742, 749, 750, 752, 765, 768, 769, 771, 782, 783, 799, 800, 806, 807, 815, 834, 843, 848, 851, 852, 855, 866, 874, 893, 903, 921, 927, 928, 948, 958, 961, 968, 969, 970, 984, 986, 987, 996, 998, 1001, 1015, 1020, 1048, 1049, 1050, 1071, 1075, 1079, 1080, 1091, 1109, 1131, 1143, 1145, 1164, 1166, 1168, 1180, 1183, 1196, 1214, 1219, 1235, 1247, 1252, 1289, 1292, 1301, 1305, 1306, 1312, 1329, 1330, 1331, 1337, 1347, 1367, 1369, 1372, 1375, 1382, 1387, 1392, 1398, 1407, 1411, 1434, 1444, 1451, 1454, 1476, 1481, 1482, 1483, 1489, 1490, 1494, 1498, 1505, 1520, 1525, 1526, 1542, 1544, 1549, 1552, 1558, 1572, 1582, 1603, 1609, 1612, 1639, 1642, 1643, 1656, 1661, 1672, 1679, 1712]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # Remove the CWD from sys.path while we load stuff.

In [259]:
data.head(10)

   target monthly_debt_capacity  ...  person_degree_type_desc default_request_term
0       1                252.39  ...                        3                    1
1       1                244.57  ...                        3                    0
2       0                 491.5  ...                        3                    0
3       0                848.65  ...                        4                    0
4       0                470.52  ...                        4                    1
5       0                490.77  ...                        0                    1
6       0                428.57  ...                        4                    0
7       1                647.87  ...                        3                    1
8       0                694.23  ...                        4                    1
9       1                209.48  ...                        3                    1

[10 rows x 12 columns]

In [260]:
# import numpy as np
# from sklearn.impute import SimpleImputer

# imp = SimpleImputer(missing_values=np.nan, strategy='mean')
# imp.fit_transform(data)

In [261]:
data.dtypes

target                             int64
monthly_debt_capacity             object
var_employment_time_in_months    float64
approved_amount                   object
approved_term                      int64
approved_interest_amount          object
var_net_income                   float64
person_gender                      int64
credit_history_marital_status      int64
var_max_sbs_qual_12m                int8
person_degree_type_desc             int8
default_request_term               int64
dtype: object

In [262]:
for i in data:
  if data[i].dtype == object:
    data[i] = pd.to_numeric(data[i], errors='ignore')

In [263]:
x_train = data.iloc[:1300,1:]
y_train = data.iloc[:1300,0]
x_test = data.iloc[1300:,1:]
y_test = data.iloc[1300:,0]

In [264]:
x_train.head(25)

   monthly_debt_capacity  ...  default_request_term
0                 252.39  ...                     1
1                 244.57  ...                     0
2                  491.5  ...                     0
3                 848.65  ...                     0
4                 470.52  ...                     1
5                 490.77  ...                     1
6                 428.57  ...                     0
7                 647.87  ...                     1
8                 694.23  ...                     1
9                 209.48  ...                     1
10                740.53  ...                     0
11                256.66  ...                     0
12                211.16  ...                     0
13                214.08  ...                     1
14                 298.9  ...                     1
15                462.32  ...                     1
16                284.24  ...                     1
17                223.24  ...                     0
18                304.33  ...                     0
19                567.25  ...                     0
20                610.52  ...                     0
21              1,790.34  ...                     0
22                695.81  ...                     1
23              1,462.75  ...                     0
24                 463.8  ...                     0

[25 rows x 11 columns]

In [265]:
data.dtypes

target                             int64
monthly_debt_capacity             object
var_employment_time_in_months    float64
approved_amount                   object
approved_term                      int64
approved_interest_amount          object
var_net_income                   float64
person_gender                      int64
credit_history_marital_status      int64
var_max_sbs_qual_12m                int8
person_degree_type_desc             int8
default_request_term               int64
dtype: object

In [271]:
type(data["monthly_debt_capacity"][21])
float(data["monthly_debt_capacity"][21])

ValueError: ignored